import java.util.Arrays;
public class Array1 {
    public static void main(String[] args) {
        int [] mas = {11, 3, 14, 16, 7};

        boolean isSorted = false; // оголошено і проініціалізовано змінну isSorted типу boolean - для подальшого використання в якості вмикача
        int buf; // оголошено змінну buff типу int - буде використовуватися в подальшому як буфер обміну

        while(!isSorted) { // вмикає цикл while (запускатиметься поки true і виконуватиме завдання котре сформульоване його тілі)
            isSorted = true; // змінній isSorted присвоюється значення true чомусь
            for (int i = 0; i < mas.length-1; i++) { /* виконується заданий цикл (щоб не вийти за межі масиву його слід
                 зменшити на 1 цикл за допомогою дописування "-1" до mas.length-1 (таким чином цикл зменшується зправа на 1
                 ніби не доходить до 5 індексу), а (щоб зменшити цикл зліва слід в ініціалізації вказати більше число за 0))*/

                if(mas[i] > mas[i+1]) { // якщо число попереднього індексу більше за число наступного
                    isSorted = false; // - кожного разу (всіх 4 (довжина масиву - 1)) свічнути isSorted на фолс

                    buf = mas[i]; // в змінну buf присвоюється значення поперднього індексу масиву mas (buf в якості буферу обміну)
                    mas[i] = mas[i+1]; // попередньму індексу присвоюється значення (число) наступного індексу
                    mas[i+1] = buf; // наступному індексу присвоюється значення (число) попереднього індексу котре заздалегідь було поміщено в buf

                    // зараз (на даному етапі) isSorted має значення false - чому далі запускається цикл while якщо умовою його запуску є значення true в isSorted?
                    // чи умовою циклу while слід вважати - запускати цикл до поки isSorted не стане true?

                }
            }
        }
        System.out.println(Arrays.toString(mas));
    }
}
